var app = new Vue({
	el: '#app',
	data: {
		todos: [{
				zb: '4',
				name: '项目'
			},
			{
				zb: '4',
				ys: '#00868B',
				name: '采购申请进度'
			}
		],
		ds_rows: [{
			name1: '项目',
			name2: '发起时间',
			name3: '发起人',
			name4: '发起部门',
			name5: '科长审批',
			name6: '部长审批',
			name7: '副总审批',
			name8: '总经理审批'
		}],
		rows: [{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '2018-05-04',
				name6: '2018-05-04',
				name7: '2018-05-04',
				name8: '2018-05-04'
			},
			{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '2018-05-04',
				name6: '2018-05-04',
				name7: '2018-05-04',
				name8: '2018-05-04'
			},
			{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '2018-05-04',
				name6: '2018-05-04',
				name7: '2018-05-04',
				name8: '2018-05-04'
			}
		],
		todos2: [{
				zb: '4',
				name: '项目'
			},
			{
				zb: '4',
				ys: '#008B45',
				name: '采购评审进度'
			}
		],
		ds_rows2: [{
			name1: '项目',
			name2: '发起时间',
			name3: '发起人',
			name4: '发起部门',
			name5: '采购科确认',
			name6: '采购部长审批',
			name7: '采购副总审批',
			name8: '采购评价会通过'
		}],
		rows2: [{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '2018-05-04',
				name6: '2018-05-04',
				name7: '2018-05-04',
				name8: '2018-05-04'
			},
			{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '2018-05-04',
				name6: '2018-05-04',
				name7: '2018-05-04',
				name8: '2018-05-04'
			},
			{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '2018-05-04',
				name6: '2018-05-04',
				name7: '2018-05-04',
				name8: '2018-05-04'
			}
		],
		todos3: [{
				zb: '4',
				name: '项目'
			},
			{
				zb: '4',
				ys: '#8B658B',
				name: '货物购入进度'
			}
		],
		ds_rows3: [{
			name1: '项目',
			name2: '发起时间',
			name3: '发起人',
			name4: '发起部门',
			name5: '订单发出',
			name6: '货物到货',
			name7: '付款开始',
			name8: '货物验收'
		}],
		rows3: [{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '2018-05-04',
				name6: '2018-05-04',
				name7: '2018-05-04',
				name8: '2018-05-04'
			},
			{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '2018-05-04',
				name6: '2018-05-04',
				name7: '2018-05-04',
				name8: '2018-05-04'
			},
			{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '2018-05-04',
				name6: '2018-05-04',
				name7: '2018-05-04',
				name8: '2018-05-04'
			}
		],
		todos4: [{
				zb: '4',
				name: '项目'
			},
			{
				zb: '2',
				ys: '#ff7575',
				name: '结果'
			}
		],
		ds_rows4: [{
			name1: '项目',
			name2: '发起时间',
			name3: '发起人',
			name4: '发起部门',
			name5: '付款进度',
			name6: '结束',
		}],
		rows4: [{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '付款结束',
				name6: '1',
			},
			{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '尚未付款',
				name6: '0',

			},
			{
				name1: '项目11',
				name2: '2018-05-04',
				name3: '菜牙',
				name4: '项目部',
				name5: '付款结束',
				name6: '1',
			}
		],
	}
});