var app = new Vue({
	el: '#app',
	data: {
		todos: [{
				zb: '4',
				name: '项目'
			},
			{
				zb: '4',
				name: '采购申请进度'
			},
			{
				zb: '4',
				name: '采购评审进度'
			},
			{
				zb: '4',
				name: '货物购入进度'
			},
			{
				zb: '1',
				name: '付款进度'
			},
			{
				zb: '1',
				name: '结束'
			}
		],
		ds_rows: [{
			name1: '项目',
			name2: '发起时间',
			name3: '发起人',
			name4: '发起部门',
			name5: '科长审批',
			name6: '部长审批',
			name7: '副总审批',
			name8: '总经理审批',
			name9: '采购科确认',
			name10: '采购部长审批',
			name11: '采购副总审批',
			name12: '采购评价会通过',
			name14: '货物到货',
			name13: '订单发出',
			name15: '付款开始',
			name16: '货物验收',
			name17: '付款结束',
			name18: '1'
		}],
		rows: [{
			name1: '项目1',
			name2: '2018-6-29',
			name3: '景天',
			name4: '生产部',
			name5: '2018-07-08',
			name6: '2018-07-08',
			name7: '2018-07-08',
			name8: '2018-07-08',
			name9: '2018-07-08',
			name10: '2018-07-08',
			name11: '2018-07-08',
			name12: '2018-07-08',
			name13: '2018-07-08',
			name14: '2018-07-08',
			name15: '2018-07-08',
			name16: '2018-07-08',
			name17: '付款结束',
			name18: '1'
		},
		{
			name1: '项目1',
			name2: '2018-6-29',
			name3: '景天',
			name4: '生产部',
			name5: '2018-07-08',
			name6: '2018-07-08',
			name7: '2018-07-08',
			name8: '2018-07-08',
			name9: '2018-07-08',
			name10: '2018-07-08',
			name11: '2018-07-08',
			name12: '2018-07-08',
			name13: '2018-07-08',
			name14: '2018-07-08',
			name15: '2018-07-08',
			name16: '2018-07-08',
			name17: '付款结束',
			name18: '1'
		},
		{
			name1: '项目1111',
			name2: '2018-6-29',
			name3: '景天',
			name4: '生产部',
			name5: '2018-07-08',
			name6: '2018-07-08',
			name7: '2018-07-08',
			name8: '2018-07-08',
			name9: '2018-07-08',
			name10: '2018-07-08',
			name11: '2018-07-08',
			name12: '2018-07-08',
			name13: '2018-07-08',
			name14: '2018-07-08',
			name15: '2018-07-08',
			name16: '2018-07-08',
			name17: '付款结束',
			name18: '1'
		},
		{
			name1: '项目1',
			name2: '2018-6-29',
			name3: '景天',
			name4: '生产部',
			name5: '2018-07-08',
			name6: '2018-07-08',
			name7: '2018-07-08',
			name8: '2018-07-08',
			name9: '2018-07-08',
			name10: '2018-07-08',
			name11: '2018-07-08',
			name12: '2018-07-08',
			name13: '2018-07-08',
			name14: '2018-07-08',
			name15: '2018-07-08',
			name16: '2018-07-08',
			name17: '付款结束',
			name18: '1'
		}
		]

	}
});